# <center> BDD SAE COMPTE RENDU </center>

# <center>SAE PHASE 1</center>

# <center>1. Présentation

<p>Titanic_train.csv est une base de données réelle qui contient les données personnelles des victimes du titanic.
    
Cette table répertorie les naufragés sous 12 attributs (colonnes)
    
À ces colonnes sont ajouter des informations supplémentaires qui permet si on effectue une recherche de sélectionner précisément un type de personnes.
    
Cette table se termine à la 891e personne ce qui signifie que la cardinalité de la table est égale à 891.
</p>

# <center>2/ Définition des attributs</center>

● PassengerId = est un numéro unique attribué a chaque passager

● Survived = signifie que si le passager a survécu,

 On note 0 si le passager est décédé/ 1 = s'il a survécu
● Pclass : à quelle classe le passager appartenait.

on note 1 pour la première classe ; 2 ; 3
● Name = le nom du passager

● Sex = le genre du passager s'il était un homme = male, femme = female

● Age = son âge

● SibSp = si le passager a à bord des membres de sa famille telle que des frères et sœurs. Si oui = 1 / non = O

● Parch = si le passager à bord a des membres de sa famille telle que ses parents ou enfant. Si oui = 1 / Non = 0

● Ticket =  signifie le numéro de ticket.

● Fare = le prix du ticket

● Cabin = le numéro de cabine

● Embarked = et le quai d'embarquement 

S = Southampton / C = Cherbourg / Q = QueenStone</p>

# <center>3.Tableau de taches</center>

<strong>PHASE 1</strong> : Analyser en binôme les différents attributs de la table est comment est constitué la base de données.
        Et en déduire les objectifs.
        Et une démo
        
<strong>Phase 2</strong> : Analyser en binôme d'une manière plus approfondi les attributs de la table, et ces informations.
        Création d'un script pour créer des tables en mode notebook
        Et une démo
        
<strong>Phase 3</strong> : Questionner notre base de données avec différentes questions, en utilisant de nouvelles commandes apprit en cours.
        Un mini rapport et script en mode notebook
        Et une démo.

# <center>Phase 2 évaluation en séance de TP, semaine 18/10</center>

● Créez les tables nécessaires                                                                                                                               
●  Un mini rapport d’une demi page attendu sur la description des tables (les attributs, les clés.)                                            
● Un mini script permettant de créer les tables                                                                                
●  Rapport et script en mode notebook (mode note)                                                                            
● A l'aide de Python et SQL, alimentez chacune des tables à partir du contenu du fichier titanic_train.csv                     
○ Une démo

<p><h2>1. Présentation  </p></h2>

Titanic_train.csv est une base de données réelle qui contient les données personnelles des victimes du titanic.                                                                                                                                

Cette table répertorie les naufragés sous 12 degrès (colonnes)


À ces colonnes sont ajouter des informations supplémentaires qui permet si on effectue une recherche de sélectionner précisément un type de personnes.



Cette table se termine à la 892e personne ce qui signifie que la cardinalité de la table est égale à 892.

Depuis la base données nous avons pu isoler une table, qui est la table <strong>PASSENGER</strong> qui est de degrès 8.

<p><h2> 2/ Définition des attributs</h2></p>

<strong>PassengerId</strong> = est un numéro unique attribué a chaque passager qui varie entre 1 et 891. PassengerID est la clé primaire, une clé primaire est la donnée qui permet d'identifier de manière unique un enregistrement dans une table.
Une clé primaire peut être composée d'une ou de plusieurs colonnes de la table.                                                                               

<strong>Survived</strong> = signifie que si le passager a survécu, on note 0 si le passager est décédé/ 1 = s'il a survécu                                               

<strong>Pclass</strong> : à quelle classe le passager appartenait, qui varie entre 1 et 3, ce qui signifie qu'il y'a 3 types de classes.                       

<strong>Name</strong> = le nom du passager                                                                                                                

<strong>Sex</strong> = le genre du passager s'il était un homme = male, femme = female                                                                    


<strong>Age</strong> = son âge                                                                                                                                           

<strong>SibSp</strong> = si le passager a à bord des membres de sa famille telle que des frères et sœurs. Si oui = 1 / non = O                                     

<strong>Parch</strong> = si le passager à bord a des membres de sa famille telle que ses parents ou enfant. Si oui = 1 / Non = 0                               

<strong>Ticket</strong> =  signifie le numéro de ticket.                                                                                                                    

<strong>Fare</strong> = le prix du ticket                                                                                                                               

<strong>Cabin</strong> = le numéro de cabine                                                                                                                      

<strong>Embarked</strong> = et le quai d'embarquement                                                                                                       

<strong>S = Southampton / C = Cherbourg / Q = QueenStown</strong>

<p> La table <strong>PASSENGER</strong> dispose de 8 degrès donc 8 attributs qui est ; <mark><strong>PassengerID,Survived,PClass,Name,Sex,Age,SIbSP,Ticket</strong></mark>

# <center>Mise en Forme</center>

<p> Pour commencer nous allons charger l'extention <mark>!python-sql</mark>, et ce connecter a la base de données <mark>PostgreSQL</mark></p>

In [2]:
%load_ext sql
print("Extension SQL activée")

Extension SQL activée

In [3]:
%sql postgresql://postgres:302003@localhost/postgres
print("Connecter")

Connecter

# <center> Création des tables nécessaires </center>

<p>Ont va dabord supprimer la table titanic si il en existe une déjà créer ;</p>

In [3]:
%%sql
DROP TABLE titanic_bdd;
SET NOCOUNT ON;

 * postgresql://postgres:***@localhost/postgres
Done.
(psycopg2.errors.SyntaxError) ERREUR:  erreur de syntaxe sur ou près de « ON »
LINE 1: SET NOCOUNT ON;
                    ^

[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/f405)

# <center>Puis nous allons recréer la base du <strong>Titanic</strong></center>

In [4]:
%%sql
create table titanic_bdd(
    PassengerId int primary key,
    Survived int,
    Pclass int,
    Name varchar(100),
    Sex varchar(10),
    Age float,
    SibSp int,
    Parch int,
    Ticket varchar(20),
    Fare float,
    Cabin varchar(20),
    Embarked varchar(1));
    SET NOCOUNT ON;

 * postgresql://postgres:***@localhost/postgres
Done.
(psycopg2.errors.SyntaxError) ERREUR:  erreur de syntaxe sur ou près de « ON »
LINE 1: SET NOCOUNT ON;
                    ^

[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/f405)

# Ensuite nous allons copier les données des attributs dans la base que nous avons recréer depuis la base original</p>

In [5]:
%%sql
copy titanic_bdd from 'C:\Users\hp018\OneDrive\Bureau\bdd\titanic_train1.csv' delimiter ',' CSV header;

SET NOCOUNT ON;

 * postgresql://postgres:***@localhost/postgres
891 rows affected.
(psycopg2.errors.SyntaxError) ERREUR:  erreur de syntaxe sur ou près de « ON »
LINE 1: SET NOCOUNT ON;
                    ^

[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [6]:
result = %sql select * from titanic_bdd

 * postgresql://postgres:***@localhost/postgres
891 rows affected.

In [7]:
print(result[1])

(2, 1, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 'female', 38.0, 1, 0, 'PC 17599', 71.2833, 'C85', 'C')

In [8]:
dataframe = result.DataFrame()
dataframe

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

# Après avoir réimplanter la base du titanic nous allons implanter la table passenger, en la supprimant et en la recréent</p>

In [13]:
%%sql
DROP TABLE IF EXISTS PASSENGERS;
SET NOCOUNT ON;

 * postgresql://postgres:***@localhost/postgres
Done.
(psycopg2.errors.SyntaxError) ERREUR:  erreur de syntaxe sur ou près de « ON »
LINE 1: SET NOCOUNT ON;
                    ^

[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [14]:
%%sql
create table passengers(
PassengerId int primary key,
Survived integer,
Pclass integer,
Name varchar(100),
Sex varchar(10),
Age float,
SibSp integer,
Parch integer);
SET NOTCOUNT ON;

 * postgresql://postgres:***@localhost/postgres
Done.
(psycopg2.errors.SyntaxError) ERREUR:  erreur de syntaxe sur ou près de « ON »
LINE 1: SET NOTCOUNT ON;
                     ^

[SQL: SET NOTCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/f405)

<strong> De là nous allons copier la tables</strong>

In [15]:
%%sql
copy passengers from 'C:\Users\hp018\OneDrive\Bureau\bdd\passenger_train.csv' delimiter ',' CSV header;
SET NOCOUNT ON;

 * postgresql://postgres:***@localhost/postgres
892 rows affected.
(psycopg2.errors.SyntaxError) ERREUR:  erreur de syntaxe sur ou près de « ON »
LINE 1: SET NOCOUNT ON;
                    ^

[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/f405)

<strong>Puis afficher le résultat de celui-ci ;</strong>

In [5]:
result = %sql select distinct * from passengers

 * postgresql://postgres:***@localhost/postgres
892 rows affected.

In [10]:
print(result[891])

(807, 0, 1, 'Andrews, Mr. Thomas Jr', 'male', 39.0, 0, 0)

In [6]:
dataframe = result.DataFrame()
dataframe

,passengerid,survived,pclass,name,sex,age,sibsp,parch
0,493.0,0.0,1.0,"Molson, Mr. Harry Markland",male,55.00,0.0,0.0
1,646.0,1.0,1.0,"Harper, Mr. Henry Sleeper",male,48.00,1.0,0.0
2,418.0,1.0,2.0,"Silven, Miss. Lyyli Karoliina",female,18.00,0.0,2.0
3,370.0,1.0,1.0,"Aubart, Mme. Leontine Pauline",female,24.00,0.0,0.0
4,832.0,1.0,2.0,"Richards, Master. George Sibley",male,0.83,1.0,1.0
...,...,...,...,...,...,...,...,...
887,129.0,1.0,3.0,"Peter, Miss. Anna",female,NaN,1.0,1.0
888,643.0,0.0,3.0,"Skoog, Miss. Margit Elizabeth",female,2.00,3.0,2.0
889,287.0,1.0,3.0,"de Mulder, Mr. Theodore",male,30.00,0.0,0.0
890,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.00,0.0,0.0
891,807.0,0.0,1.0,"Andrews, Mr. Thomas Jr",male,39.00,0.0,0.0

#  <center>SAE PARTIE 3 POUR LA SEMAINE DU 29/11

<strong>Combien de classes de passagers différentes y avait-il à bord du Titanic ?</strong>

<strong>Ici pour trouver combien de classes de passagers différents il y a,
ont sélectionne et ont compte dans la base donnée la colonne pclass qui représente les classes sans séléctionner les doublons </strong>

In [3]:
%%sql
Select count(distinct pclass) as Classes_Différente from passengers;

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[(3,)]

<strong> Ici ont va selectionner distinctement sans prendre les doublons les classes différentes et les lister.</strong>

In [7]:
%%sql
select distinct pclass as Classes from passengers order by pclass;

 * postgresql://postgres:***@localhost/postgres
4 rows affected.

[(1,), (2,), (3,), (None,)]

## Combien y avais t-il de passagers dans chaque classes ? </strong>

<strong> Ici nous allons selectionner comme au questions dernière les différentes Classes,
et compter combien de passagers il y avais dans chaque classes grâce au Count</strong>

In [9]:
%%sql
select pclass,COUNT(pclass) as Passagers from passengers group by pclass ORDER BY pclass;

 * postgresql://postgres:***@localhost/postgres
4 rows affected.

[(1, 216), (2, 184), (3, 491), (None, 0)]

In [43]:
print(216+184+491)

891

# Combien de femmes et d'hommes y avait-il dans chaque classe ? </strong>

<strong>Ici nous allons selectionner les classes différentes et les passagers qu il y a dedans mais,selectionner seulement quand les passagers sont des hommes ou des femmes</strong>

In [5]:
%%sql
select pclass,count(*) as Hommes from passengers where sex='male' group by pclass order by pclass;

 * postgresql://postgres:***@localhost/postgres
3 rows affected.

[(1, 122), (2, 108), (3, 347)]

In [14]:
%%sql
select pclass,count(*) as Femmes from passengers where sex='female' group by pclass order by pclass;

 * postgresql://postgres:***@localhost/postgres
3 rows affected.

[(1, 94), (2, 76), (3, 144)]

In [8]:
print(94+76+144,"Femmes")
print(122+108+347,"Hommes")
print("Total :",314+577)

314 Femmes
577 Hommes
Total : 891

# Comptez le nombre et le pourcentage de survivants et de passagers morts ?</strong>

<strong> Ici nous allons compter grâce au COUNT les passagers qui ont survécu pour cela,
ont va seulement compter les passagers ou dans la colonne survived est égale a 1 qui veut dire qu ils ont survécu
et donc 0 pour ceux qui sont décedée | Pour le pourcentage j'ai compter toutes les personnes puis je l'est ai multiplier par 100 et diviser par les passagers qui ont survécu de même pour les passagers qui sont décédée
</strong>

In [45]:
%%sql
select COUNT(*) as Passagers_survivant from passengers where survived = 1;

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[(342,)]

In [16]:
%%sql
Select (Count(survived)* 100 / (Select Count(*) from passengers)) as Score
from passengers where survived = 1 Group By survived

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[(38,)]

In [17]:
%%sql
select COUNT(*) as Passager_décédée from passengers where survived = 0;

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[(549,)]

In [38]:
print(342+549)
print(38+61,"%")

891
99 %

In [18]:
%%sql
Select (Count(survived)* 100 / (Select Count(*) from passengers)) as Score
from passengers where survived = 0 group by survived;

 * postgresql://postgres:***@localhost/postgres
1 rows affected.

[(61,)]

# Visualiser la répartition des passagers survivants et morts par classe ?</strong>

<strong> Pour visualiser la répartition des passagers ont va sélectionner les Classes et compter ceux qui ont survecu/décédée,
dans le différentes classes</strong>

In [6]:
%%sql
select pclass,COUNT(*) as Passagers_survivant from passengers where survived = 1 group by pclass order by pclass;

 * postgresql://postgres:***@localhost/postgres
3 rows affected.

[(1, 136), (2, 87), (3, 119)]

In [39]:
print(136+87+119)

342

In [20]:
%%sql
select pclass,COUNT(*) as Passagers_décédée from passengers where survived = 0 group by pclass order by pclass;

 * postgresql://postgres:***@localhost/postgres
3 rows affected.

[(1, 80), (2, 97), (3, 372)]

In [1]:
print(80+97+372)
print(342+549)

549
891

# Visualiser la répartition des passagers survivants et des passagers décédés selon le sexe ?</strong>

<strong> Ici ont va selectionner les genres différent et compter les passagers selon que ce soit des hommes et femmes seulement,
quand ils ont survecu et quand ils non pas survecu</strong>

In [7]:
%%sql
select sex,count(*) as Passagers_survivant from passengers where survived = 1 group by sex;

 * postgresql://postgres:***@localhost/postgres
2 rows affected.

[('male', 109), ('female', 233)]

In [22]:
%%sql
select sex,count(*) as Passagers_décédée from passengers where survived = 0 group by sex;

 * postgresql://postgres:***@localhost/postgres
2 rows affected.

[('female', 81), ('male', 468)]

In [41]:
print(109+233+81+468)

891